Creating DataFrames

In [2]:
import pandas as pd

In [3]:
data = [['Ani', 90], ["alek", 80], ["Ashu", 56], ["Chandan", 78]]

In [4]:
data

[['Ani', 90], ['alek', 80], ['Ashu', 56], ['Chandan', 78]]

In [5]:
pd.DataFrame(data, columns=["Name", "Marks"])

      Name  Marks
0      Ani     90
1     alek     80
2     Ashu     56
3  Chandan     78

In [11]:
df = pd.read_excel("data.xlsx")

In [12]:
df

      Name   School  Marks
0   Aniket       kv     78
1     Alek       st     84
2     Ashu      hub     59
3  Chandan   stmary     45
4      Dev  stpeter     78
5     Abhi     sans     98
6      Ani     audi     63
7     Udit     aghi     55

In [20]:
df = pd.read_json("data.json")

In [21]:
df

     name    Lang
0  Aniket  Python
1     Ani     cpp